app/Controllers/Admin/Auth.php

    public function login()
    {

        helper(['form']);
        $session = session();

        if ($this->request->getMethod() === 'POST') {

            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1