app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `posts`
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 'draft'
SELECT *
FROM `posts`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function index()
    {
        $postModel = new PostModel();

        $totalPosts     = $postModel->countAll();
        $publishedPosts = $postModel->where('status', 'published')->countAllResults();
        $draftPosts     = $postModel->where('status', 'draft')->countAllResults();

        // Fetch latest 5 posts
        $latestPosts = $postModel->orderBy('created_at', 'DESC')->findAll(5);