app/Controllers/Admin/Posts.php

    public function index()
    {
        helper('text');
        $data['posts'] = $this->postModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `posts`
ORDER BY `created_at` DESC

    public function store()
    {

        $data = [
            'title' => $this->request->getPost('title'),
            'slug'  => url_title($this->request->getPost('title'), '-', true),
            'post_excerpt' => $this->request->getPost('post_excerpt'),
            'body'  => $this->request->getPost('body'),
            'image_url' => $this->request->getPost('image_url'),
            'status' => $this->request->getPost('status'),
        ];

        try {
            $this->postModel->insert($data);
---
INSERT INTO `posts` (`title`, `slug`, `post_excerpt`, `body`, `image_url`, `status`, `created_at`, `updated_at`) VALUES ('Exploring the Great Outdoors', 'exploring-the-great-outdoors', 'Tips for enjoying nature safely and responsibly.', '<p>Hiking and camping are excellent ways to reconnect with nature. Always pack essentials, respect wildlife, and leave no trace. Remember, preparation ensures fun without unnecessary risks.</p>', 'https://images.dog.ceo/breeds/wolfhound-irish/n02090721_1452.jpg', 'draft', '2025-10-15 13:06:27', '2025-10-15 13:06:27')

    public function edit($id)
    {
        $data['post'] = $this->postModel->find($id);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '2'

    public function update($id)
    {
        $data = [
            'title' => $this->request->getPost('title'),
            'slug'  => url_title($this->request->getPost('title'), '-', true),
            'post_excerpt' => $this->request->getPost('post_excerpt'),
            'body'  => $this->request->getPost('body'),
            'image_url' => $this->request->getPost('image_url'),
            'status' => $this->request->getPost('status'),
        ];

        $this->postModel->update($id, $data);
---
UPDATE `posts` SET `title` = 'Exploring the Great Outdoors', `slug` = 'exploring-the-great-outdoors', `post_excerpt` = 'Tips for enjoying nature safely and responsibly.', `body` = '<p>Hiking and camping are excellent ways to reconnect with nature. Always pack essentials, respect wildlife, and leave no trace. Remember, preparation ensures fun without unnecessary risks.</p>', `image_url` = 'https://images.dog.ceo/breeds/wolfhound-irish/n02090721_1452.jpg', `status` = 'published', `updated_at` = '2025-10-15 13:07:08'
WHERE `posts`.`id` IN ('2')