app/Controllers/Blog.php

    public function view($slug)
    {
        helper('text');
        $postModel = new PostModel();

        // Get the main post
        $post = $postModel->getBySlug($slug);

        if (!$post || $post['status'] !== 'published') {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Post not found');
        }

        // Get other published posts excluding the current one
        $otherPosts = $postModel
            ->where('status', 'published')
            ->where('slug !=', $slug)
            ->orderBy('created_at', 'DESC')
            ->findAll(3); // You can change '3' to show more posts
---
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `slug` != '10-tips-for-caring-your-dog'
ORDER BY `created_at` DESC
 LIMIT 3