app/Models/PostModel.php

SELECT *
FROM `posts`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
---
    public function getPublished()
    {
        return $this->where('status', 'published')->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `posts`
WHERE `slug` = '10-tips-for-caring-your-dog'
 LIMIT 1
---
    public function getBySlug($slug)
    {
        return $this->where('slug', $slug)->first();